Revit 2024 API
View.CanModifyDisplayStyle Method
 Indicates if DisplayStyle can be modified.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public bool CanModifyDisplayStyle()
Visual Basic
Public Function CanModifyDisplayStyle As Boolean
Visual C++
public:
bool CanModifyDisplayStyle()
Return Value
 True if DisplayStyle can be modified.
See Also
View Class
Autodesk.Revit.DB Namespace